Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup.IncompatibleNumber Property
 Gets or sets the load group incompatible number.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IncompatibleNumber { get; set; }
Public Property IncompatibleNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnalysisLoadGroup Class
Tekla.Structures.Analysis Namespace